tutorials/consistentSolvers/airfoil/alpha25/consistentSimpleFoam/0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include       "initialConditions"

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform $nut;

boundaryField
{
	"(top|bottom)"
    {
        type 			nutWallFunction;
	value 			uniform 0;
    }
    
    farfield
    {
        type           calculated;
    }
    
    frontback
    {
        type           empty;
    }
}


// ************************************************************************* //
